with ch_cx_sq as (
select distinct
	c18.설문조사방식구분 as 설문조사방식구분코드,
	c18.설문조사대상구분 as 설문조사대상구분코드,
	c18.고객경험단계구분 as 고객경험단계구분코드,
	cx_name.인스턴스내용 as 고객경험단계구분명,
	c18.서비스품질요소코드,
	c07.서비스품질요소명,
	c18.고객경험요소구분 as 고객경험요소코드,
	c18.고객경험요소명,
	c18.고객경험요소내용 as 관리목표
from inst1.tsccvci18 c18
join ( 
select 그룹회사코드 
 , 설문조사방식구분 
 , 설문조사종류구분 
 , case when 설문조사방식구분 = '02' and 설문조사종류구분 = '03' and 고객경험단계구분 in ('07','08','09','10','11','12')  then '09' 
   else 설문조사대상구분 end as 설문조사대상구분 
 , 서비스품질요소코드 
 , 서비스품질요소명 
 , 서비스품질요소설명내용 
 , 고객경험단계구분 
 , 사용여부, 정렬순서   
from inst1.tsccvci07 
) c07
on c18.그룹회사코드 = c07.그룹회사코드 and c18.설문조사방식구분 = c07.설문조사방식구분 and c18.설문조사종류구분 = c07.설문조사종류구분 and c18.설문조사대상구분 = c07.설문조사대상구분 and c18.서비스품질요소코드 = c07.서비스품질요소코드
join (
select * -- kbds로부터 전달받은 고객경험단계 인스턴스 join 쿼리
from inst1.tsccvci04 
where 그룹회사코드 = 'KB0' 
and 인스턴스식별자= '142594000'
) cx_name on c18.고객경험단계구분 = cx_name.인스턴스코드
order by 고객경험요소구분
)
select distinct 고객경험단계구분명, 서비스품질요소명
from ch_cx_sq
where 설문조사방식구분코드='02'
  and 설문조사대상구분코드='{chan}'
  and 고객경험단계구분코드='{cx}'
  and 서비스품질요소코드='{cxc}'